// ignore_for_file: unnecessary_const

import 'package:flutter/cupertino.dart';
import 'imagesCfg.dart';
import '../OnHover.dart';
import 'package:flutter/material.dart';

var Caustic = Legends(
    'assets/images/Caustic.webp',
    'КАУСТИК',
    '\nЛовчий отравитель',
    '\n\n    Когда-то Александр Нокс был одним из самых выдающихся ученых в компании «Хамберт Лабс», ведущем производителем газов-пестицидов Фронтира. '
        'Нокс работал днем и ночью, разрабатывая новые формулы для все возрастающих объемов поставок, необходимых для защиты посевов и обеспечения Внешних земель. '
        'Но вскоре он осознал, что одобренные методы тестирования стали препятствием для его научной работы. '
        'Ему были необходимы опыты не только над образцами ткани: нужны были живые организмы.'
        '\n\n    Нокс вел свои разработки тайно и со временем начал видеть красоту в своих произведениях и их способности разрушить все, с чем они соприкасаются.'
        'Но вскоре глава «Хамберт Лабс» узнал о его жутких экспериментах. После их разговора в лаборатории начался пожар. '
        'Теперь, участвуя в Играх Apex под именем Каустик, он испытывает свои газовые творения на арене и с интересом наблюдает за их действием.');

var Mirage = Legends(
    'assets/images/Mirage.webp',
    "МИРАЖ",
    "\nГолографический трюкач",
    "\n\n    Мираж из тех людей, что любят выделяться. Будучи младшим из четырех братьев, "
        "он в совершенстве освоил искусство дурачиться, стремясь заполучить внимание. "
        "Единственное, к чему он относится серьезно, — это технология голопилота. С тех пор как мать-инженер познакомила его с искусством создания иллюзий, "
        "он все свое время проводил за механизмами, пока не узнал о них все, что мог. "
        "Даже когда его братья пропали без вести во время войны на Фронтире, Мираж продолжал разрабатывать голоустройства вместе с матерью, и эта работа сблизила их. "
        "\n\n    Работая барменом и едва сводя концы с концами, Мираж не раз слышал от посетителей дивные истории об Играх Apex и о том, какие богатство и славу приносит победа в них. "
        "Как бы заманчиво это для него ни звучало, он не хотел подвергать свою мать риску потерять всех своих детей. "
        "Но в конце концов она сама дала ему набор персональных голографических устройств и велела следовать за мечтой. "
        "Теперь же благодаря своему умению обставлять соперников и очаровывать зрителей Мираж — душа Игр Apex.");

var Octane = Legends(
    'assets/images/Octane.webp',
    "ОКТЕЙН",
    "\nСкоростной сорвиголова",
    "\n\n    В один прекрасный день Октавио Сильва заскучал. Впрочем, скука — его нормальное состояние."
        "Сынок вечно занятого директора корпорации «Сильва Фармасьютикалс», золотой мальчик, у которого было все, что только можно пожелать... "
        "Единственным занятием, которое хоть как-то развлекало его, было исполнение все более рискованных трюков и съемка головидео для восхищенных фанатов. "
        "И в этот самый день он вознамерился преодолеть полосу препятствий за рекордное время, перебросив себя через финишную черту... взрывом гранаты. "
        "\n\n    Позже, уже в приемном отделении, врачи сообщили, что спасти его ноги невозможно. Лихим денькам сорвиголовы пришел бесславный конец. "
        "Октавио такой расклад не понравился, и он обратился за помощью к старой подруге. "
        "Его манипуляции с чувством вины достигли цели: Аджей Че создала для него бионические протезы. "
        "Едва научившись ходить на новых ногах, которые теперь можно было запросто подлатать после любых повреждений, "
        "Октавио решил, что карьера каскадера — слишком ничтожное поприще. Игры Apex, настоящий рай для охотников за адреналином, выглядели куда заманчивей. "
        "Теперь он намерен использовать свои умопомрачительные трюки для того, чтобы стать чемпионом Apex — и бросить очередной вызов смерти."
        "Может быть, хотя бы на арене ему не будет скучно.");

var Pathfinder = Legends(
    'assets/images/Pathfinder.webp',
    "ПАТФАЙНДЕР",
    "\nИдеальный разведчик",
    "\n\n    Патфайндер — образец оптимизма, невзирая на обстоятельства. "
        "МРВН — Мобильный роботизированный всецелевой напарник, настроенный для разведки и съемки местности. "
        "Он включился несколько десятилетий назад на заброшенном складе, не имея представления о том, кто и зачем его создал. "
        "Не зная ничего, кроме своей МРВН-классификации, Патфайндер в конце концов отправился на поиски своего создателя."
        "\n\n    С тех пор Патфайндер многое узнал в своих странствиях (например, как приготовить дрянное рагу из левиафана по-восточному), "
        "но к нахождению создателя так и не приблизился. Однако он по-прежнему не оставляет надежды. На Играх Apex он рассчитывает найти сторонников... "
        "и в конечном итоге обратить на себя внимание своего создателя. Он остается полон энтузиазма, всегда готов помочь и завести новых друзей (а потом застрелить их).");

var Revenant = Legends(
    'assets/images/Revenant.webp',
    "РЕВЕНАНТ",
    "\nРукотворный кошмар",
    "\n\n    Когда-то Ревенант был человеком. Наемным убийцей Синдиката, лучшим из лучших."
        "Он смотрел в зеркало и видел в нем свое человеческое лицо. "
        "Но время ничего не щадит, и когда его программа наконец дала сбой, он осознал, во что его превратили «Хаммонд Роботикс» и Синдикат наемников: кошмар наяву,"
        "сотворённый из стали и остатков плоти. Его хозяева возрождали своего верного симулякра, раз за разом вырывая из объятий смерти, а программа заставляла его забывать обо всем."
        "\n\n    Он поклялся выследить всех, кто был причастен к его перерождению. Но с тех пор прошло больше двухсот лет, и никого из них уже нет в живых... "
        "По крайней мере, так ему казалось. Возвращение «Хаммонд Роботикс» во Внешние земли возродило в нем жажду мести, и он не остановится до тех пор,"
        "пока не перебьет каждого, кто имеет хоть малейшее отношение к корпорации."
        "Впрочем, если ему под руку попадется парочка легенд, он с удовольствием разрежет их в клочья. Когда-то ему нужна была причина для убийства..."
        "но с тех пор в нем многое изменилось.");

var Valkyrie = Legends(
    'assets/images/Valkyrie.webp',
    "ВАЛЬКИРИЯ",
    "\nКрылатая мстительница",
    "\n\n    Смелая, дерзкая, пылкая и свирепая Кайри Имахара не гнушается давать взятки и преступать закон."
        "В детстве она украла Титана. Он принадлежал ее отцу — пилоту с позывным «Гюрза». Она хотела стать как отец, когда вырастет. Но однажды он отправился на задание и больше не вернулся. "
        "В некотором смысле она все же пошла по его стопам — правда, она управляла не Титаном, а кораблем. Но этого было достаточно, чтобы обеспечить себе достойную жизнь. "
        "А вот ее личную жизнь достойной было никак не назвать. Днем она провозила контрабандой драгоценный груз, а по ночам якшалась с преступниками и наемниками."
        "И хотя у нее не было недостатка в партнершах, алкоголе и небе, ее все же снедало желание найти того, из-за кого погиб ее отец — его командира Кубена Блиска."
        "\n\n    Она выследила Блиска и была готова убить его. Но он уважительно отзывался о ее отце — и предложил ей стать лучше."
        "Она все равно выстрелила. Но не забрала его жизнь. Ей было достаточно знать, что его жизнь была в ее власти. И все же кое-что она у него забрала — карточку Игр Apex."
        "Кайри решила превратить целое ядро полета из «Нордстара» Гюрзы в изящный реактивный ранец, с помощью которого она намеревалась воздать должное памяти своего отца. "
        "Так она наконец-то смогла взмыть в воздух на своих условиях... в своеобразной версии отцовского Титана, который в результате все же отошел ей.");

class Legends extends StatelessWidget {
  var ImagePath, LegendName, LegendRole, LegendInfo;
  Legends(Path, Name, Role, Info) {
    ImagePath = Path;
    LegendName = Name;
    LegendRole = Role;
    LegendInfo = Info;
  }

  @override
  Widget build(BuildContext context) {
    return Container(
      padding: imagesPadding,
      child: OnHover(builder: (isHovered) {
        if (isHovered == true) {
          return Container(
              decoration: BoxDecoration(
                  border: Border.all(
                      color: Color.fromARGB(255, 177, 30, 30), width: 5.0)),
              width: ImagesWidth + 9,
              height: ImagesHeight + 9,
              child: Stack(children: [
                Image.asset(ImagePath,
                    height: ImagesHeight, width: ImagesWidth, fit: BoxFit.fill),
                Container(
                  height: ImagesHeight,
                  width: ImagesWidth,
                  color: Color.fromARGB(200, 80, 80, 80),
                ),
                Container(
                    padding: EdgeInsets.fromLTRB(20, 20, 20, 0),
                    height: ImagesHeight,
                    width: ImagesWidth,
                    child: Column(children: [
                      Text(
                        LegendName,
                        style: TextStyle(
                            fontSize: 46,
                            color: Colors.white,
                            fontWeight: FontWeight.bold),
                      ),
                      Text(LegendRole,
                          style: TextStyle(
                            fontSize: 23,
                            color: Colors.white,
                          )),
                      Column(children: [
                        Text(
                          LegendInfo,
                          softWrap: true,
                          style: TextStyle(
                              fontSize: 14,
                              color: Colors.white,
                              fontFamily: "Roboto"),
                        )
                      ])
                    ]))
              ]));
        } else {
          return Container(
              decoration: BoxDecoration(
                  border: Border.all(
                      color: Color.fromARGB(255, 177, 30, 30), width: 5.0)),
              child: Stack(
                children: [
                  Image.asset(ImagePath,
                      height: ImagesHeight,
                      width: ImagesWidth,
                      fit: BoxFit.fill),
                ],
              ));
        }
      }),
    );
  }
}
